In [2]:
import pandas as pd

In [7]:
voos = pd.read_csv('../../aulas/data/aulas/jucao_tables/voos.csv', delimiter=';')

In [9]:
voos.head

<bound method NDFrame.head of      year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]>

In [10]:
voos.head(6)

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121
5  1949   Jun         135

In [11]:
qtd_voos = pd.read_csv('../..//aulas/data/aulas/jucao_tables/quatidade_de_voos.csv', delimiter=';')

In [12]:
qtd_voos.head

<bound method NDFrame.head of    month  qnt
0    Jan  284
1    Feb  345
2    Mar  234
3    Apr  623
4    May  372
5    Jun  693
6    Jul  482
7    Aug  386
8    Sep  396
9    Oct  376
10   Nov  262
11   Dec  436>

In [14]:
qtd_voos.head() #delimitar a exbição da tabela a 4 unidades

  month  qnt
0   Jan  284
1   Feb  345
2   Mar  234
3   Apr  623
4   May  372

In [15]:
pd.merge(voos, qtd_voos, on='month') #adicionar uma tabela do lado da outra

     year month  passengers  qnt
0    1949   Jan         112  284
1    1950   Jan         115  284
2    1951   Jan         145  284
3    1952   Jan         171  284
4    1953   Jan         196  284
..    ...   ...         ...  ...
139  1956   Dec         306  436
140  1957   Dec         336  436
141  1958   Dec         337  436
142  1959   Dec         405  436
143  1960   Dec         432  436

[144 rows x 4 columns]

In [30]:
produtos1 = pd.read_csv('../../aulas/data/aulas/jucao_tables/produtos1.csv', delimiter = ';', index_col='id')

In [31]:
produtos1.head()

              nome preco
id
1         sabonete   5,4
2   pasta de dente   7,9
3      desodorante  15,4

In [91]:
produtos2 = pd.read_csv('../../aulas/data/aulas/jucao_tables/produtos2.csv', delimiter = ';', index_col='id')

In [93]:
produtos2.head()

                nome preco
id
4   escova de dentes  34,2
5          amaciante  37,8
6      condicionador  12,9

In [99]:
produtos = pd.concat([produtos1, produtos2])

In [45]:
produtos.head()

                nome preco
id
1           sabonete   5,4
2     pasta de dente   7,9
3        desodorante  15,4
4   escova de dentes  34,2
5          amaciante  37,8

In [102]:
vendas = pd.read_csv('../../aulas/data/aulas/jucao_tables/vendas.csv', delimiter = ';')

In [103]:
vendas.head()

         data  quantidade  produto_id
0  01/01/2022          10           1
1  02/01/2022           5           2
2  03/01/2022           7           1
3  04/01/2022          12           3

In [104]:
vendas = vendas.join(produtos, on='produto_id')

In [105]:
vendas.head()

         data  quantidade  produto_id            nome preco
0  01/01/2022          10           1        sabonete   5,4
1  02/01/2022           5           2  pasta de dente   7,9
2  03/01/2022           7           1        sabonete   5,4
3  04/01/2022          12           3     desodorante  15,4

In [110]:
vendas['preco'] = vendas['preco'].str.replace(',', '.', regex=False) #mudar , para . entre a string

In [111]:
vendas.head()

         data  quantidade  produto_id            nome preco
0  01/01/2022          10           1        sabonete   5.4
1  02/01/2022           5           2  pasta de dente   7.9
2  03/01/2022           7           1        sabonete   5.4
3  04/01/2022          12           3     desodorante  15.4

In [114]:
vendas['preco'] = vendas['preco'].astype(float) #converter uma string para float

In [115]:
vendas['total'] = vendas.quantidade * vendas.preco

In [116]:
vendas.head()

         data  quantidade  produto_id            nome  preco  total
0  01/01/2022          10           1        sabonete    5.4   54.0
1  02/01/2022           5           2  pasta de dente    7.9   39.5
2  03/01/2022           7           1        sabonete    5.4   37.8
3  04/01/2022          12           3     desodorante   15.4  184.8